In [1]:
import pandas as pd

In [4]:
#Q1: Create a Series with indexes = 1, 2, 3 and has three names.
lst = [1,2,3] 
s = pd.Series(lst)
s

0    1
1    2
2    3
dtype: int64

In [5]:
#Q2: Change indexes to 11, 12, 13.
s = pd.Series(lst, index=[11, 12, 13 ])
s

11    1
12    2
13    3
dtype: int64

In [6]:
#Q3: Retrieve First and second elements.
s.head(2)

11    1
12    2
dtype: int64

In [10]:
#Q4: Add duplicate elements, then remove the duplication
s1=pd.Series({14:3})
s=s.append(s1)
s

C:\Users\96650\AppData\Local\Temp\ipykernel_10332\3432841071.py:3: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s=s.append(s1)

11    1
12    2
13    3
14    3
dtype: int64

In [11]:
s.drop_duplicates()

11    1
12    2
13    3
dtype: int64

In [17]:
#Q5:Create a Students DataFrame has three columns (ID, Name)
Students={'ID':[1111,22222]
    ,'Name':['RAZAN','nora']}
d = pd.DataFrame(Students, columns=['ID', 'Name'])
d

      ID   Name
0   1111  RAZAN
1  22222   nora

In [20]:
#Q6: Read educ_figdp_1_Data.csv file
edu=pd.read_csv('/Users/96650/Documents/educ_figdp_1_Data.csv')
edu

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.9,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.1,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

In [24]:
#Q7: What is the difference between loc and slicing?
#loc :enters the last index
#slicing: not enters the last index
edu.loc[90:94]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
90,2006,Belgium,Total public expenditure on education as % of ...,5.98,d
91,2007,Belgium,Total public expenditure on education as % of ...,6,d
92,2008,Belgium,Total public expenditure on education as % of ...,6.43,d
93,2009,Belgium,Total public expenditure on education as % of ...,6.57,d
94,2010,Belgium,Total public expenditure on education as % of ...,6.58,d

In [25]:
edu[1:5]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e